tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jandedobbeleer/oh-my-posh"
tap "mistertea/et"
tap "romkatv/gitstatus"
tap "romkatv/powerlevel10k"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "colima"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-compose-completion"
brew "fd"
brew "gh"
brew "git"
brew "gnu-tar"
brew "go"
brew "grep"
brew "gron"
brew "helm"
brew "htop"
brew "jq"
brew "k9s"
brew "openjdk"
brew "kafka"
brew "kompose"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "less"
brew "lesspipe"
brew "librdkafka"
brew "lsof"
brew "maven"
brew "maven-completion"
brew "socat"
brew "openshift-cli"
brew "openssh"
brew "openssl@3"
brew "poetry"
brew "python@3.8"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "terraform"
brew "wget"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "eth-p/software/bat-extras"
brew "mistertea/et/et"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "aerial"
cask "confluent-cli"
cask "font-fira-code-nerd-font"
cask "hammerspoon"
cask "iterm2"
cask "the-clock"
cask "visual-studio-code"
