tap "eth-p/software"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "zkondor/dist"
brew "bash-completion@2"
brew "bat"
brew "binutils"
brew "certifi"
brew "lima"
brew "colima"
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fprobe"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-tar"
brew "go"
brew "grep"
brew "gron"
brew "helm"
brew "htop"
brew "httpie"
brew "jq"
brew "kubectx"
brew "less"
brew "lesspipe"
brew "lsof"
brew "lua"
brew "mandoc"
brew "openssh"
brew "pandoc"
brew "pipx"
brew "pkg-config"
brew "poppler"
brew "python@3.10"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "valkey"
brew "yt-dlp"
brew "zsh"
brew "eth-p/software/bat-extras"
cask "android-platform-tools"
cask "crystalfetch"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-twitter-color-emoji"
cask "git-credential-manager"
cask "hammerspoon"
cask "heroic"
cask "kodi"
cask "orbstack"
cask "stats"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "whisky"
cask "xquartz"
cask "znotch"
cask "zulu"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "brunnerh.insert-unicode"
vscode "danielsanmedium.dscodegpt"
vscode "davidanson.vscode-markdownlint"
vscode "davidnussio.vscode-jq-playground"
vscode "dbaeumer.vscode-eslint"
vscode "dbankier.vscode-quick-select"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hangxingliu.vscode-systemd-support"
vscode "hashicorp.terraform"
vscode "hilleer.yaml-plus-json"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mscgenjs.vscode-mscgen"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.vscode-yaml"
vscode "stkb.rewrap"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.gistfs"
vscode "yinfei.luahelper"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
